GopalSaraf/Practicals/PSDL/include/proc/pic18f66k40.h
// Register: SLRCONF
#define SLRCONF SLRCONF
extern volatile unsigned char           SLRCONF             __at(0xEB1);
#ifndef _LIB_BUILD
asm("SLRCONF equ 0EB1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRF0                  :1;
        unsigned SLRF1                  :1;
        unsigned SLRF2                  :1;
        unsigned SLRF3                  :1;
        unsigned SLRF4                  :1;
        unsigned SLRF5                  :1;
        unsigned SLRF6                  :1;
        unsigned SLRF7                  :1;
    };
} SLRCONFbits_t;
extern volatile SLRCONFbits_t SLRCONFbits __at(0xEB1);
// bitfield macros
#define _SLRCONF_SLRF0_POSN                                 0x0
#define _SLRCONF_SLRF0_POSITION                             0x0
#define _SLRCONF_SLRF0_SIZE                                 0x1
#define _SLRCONF_SLRF0_LENGTH                               0x1
#define _SLRCONF_SLRF0_MASK                                 0x1
#define _SLRCONF_SLRF1_POSN                                 0x1
#define _SLRCONF_SLRF1_POSITION                             0x1
#define _SLRCONF_SLRF1_SIZE                                 0x1
#define _SLRCONF_SLRF1_LENGTH                               0x1
#define _SLRCONF_SLRF1_MASK                                 0x2
#define _SLRCONF_SLRF2_POSN                                 0x2
#define _SLRCONF_SLRF2_POSITION                             0x2
#define _SLRCONF_SLRF2_SIZE                                 0x1
#define _SLRCONF_SLRF2_LENGTH                               0x1
#define _SLRCONF_SLRF2_MASK                                 0x4
#define _SLRCONF_SLRF3_POSN                                 0x3
#define _SLRCONF_SLRF3_POSITION                             0x3
#define _SLRCONF_SLRF3_SIZE                                 0x1
#define _SLRCONF_SLRF3_LENGTH                               0x1
#define _SLRCONF_SLRF3_MASK                                 0x8
#define _SLRCONF_SLRF4_POSN                                 0x4
#define _SLRCONF_SLRF4_POSITION                             0x4
#define _SLRCONF_SLRF4_SIZE                                 0x1
#define _SLRCONF_SLRF4_LENGTH                               0x1
#define _SLRCONF_SLRF4_MASK                                 0x10
#define _SLRCONF_SLRF5_POSN                                 0x5
#define _SLRCONF_SLRF5_POSITION                             0x5
#define _SLRCONF_SLRF5_SIZE                                 0x1
#define _SLRCONF_SLRF5_LENGTH                               0x1
#define _SLRCONF_SLRF5_MASK                                 0x20
#define _SLRCONF_SLRF6_POSN                                 0x6
#define _SLRCONF_SLRF6_POSITION                             0x6
#define _SLRCONF_SLRF6_SIZE                                 0x1
#define _SLRCONF_SLRF6_LENGTH                               0x1
#define _SLRCONF_SLRF6_MASK                                 0x40
#define _SLRCONF_SLRF7_POSN                                 0x7
#define _SLRCONF_SLRF7_POSITION                             0x7
#define _SLRCONF_SLRF7_SIZE                                 0x1
#define _SLRCONF_SLRF7_LENGTH                               0x1
#define _SLRCONF_SLRF7_MASK                                 0x80

// Register: ODCONF
#define ODCONF ODCONF
extern volatile unsigned char           ODCONF              __at(0xEB2);
#ifndef _LIB_BUILD
asm("ODCONF equ 0EB2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCF0                  :1;
        unsigned ODCF1                  :1;
        unsigned ODCF2                  :1;
        unsigned ODCF3                  :1;
        unsigned ODCF4                  :1;
        unsigned ODCF5                  :1;
        unsigned ODCF6                  :1;
        unsigned ODCF7                  :1;
    };
} ODCONFbits_t;
extern volatile ODCONFbits_t ODCONFbits __at(0xEB2);
// bitfield macros
#define _ODCONF_ODCF0_POSN                                  0x0
#define _ODCONF_ODCF0_POSITION                              0x0
#define _ODCONF_ODCF0_SIZE                                  0x1
#define _ODCONF_ODCF0_LENGTH                                0x1
#define _ODCONF_ODCF0_MASK                                  0x1
#define _ODCONF_ODCF1_POSN                                  0x1
#define _ODCONF_ODCF1_POSITION                              0x1
#define _ODCONF_ODCF1_SIZE                                  0x1
#define _ODCONF_ODCF1_LENGTH                                0x1
#define _ODCONF_ODCF1_MASK                                  0x2
#define _ODCONF_ODCF2_POSN                                  0x2
#define _ODCONF_ODCF2_POSITION                              0x2
#define _ODCONF_ODCF2_SIZE                                  0x1
#define _ODCONF_ODCF2_LENGTH                                0x1
#define _ODCONF_ODCF2_MASK                                  0x4
#define _ODCONF_ODCF3_POSN                                  0x3
#define _ODCONF_ODCF3_POSITION                              0x3
#define _ODCONF_ODCF3_SIZE                                  0x1
#define _ODCONF_ODCF3_LENGTH                                0x1
#define _ODCONF_ODCF3_MASK                                  0x8
#define _ODCONF_ODCF4_POSN                                  0x4
#define _ODCONF_ODCF4_POSITION                              0x4
#define _ODCONF_ODCF4_SIZE                                  0x1
#define _ODCONF_ODCF4_LENGTH                                0x1
#define _ODCONF_ODCF4_MASK                                  0x10
#define _ODCONF_ODCF5_POSN                                  0x5
#define _ODCONF_ODCF5_POSITION                              0x5
#define _ODCONF_ODCF5_SIZE                                  0x1
#define _ODCONF_ODCF5_LENGTH                                0x1
#define _ODCONF_ODCF5_MASK                                  0x20
#define _ODCONF_ODCF6_POSN                                  0x6
#define _ODCONF_ODCF6_POSITION                              0x6
#define _ODCONF_ODCF6_SIZE                                  0x1
#define _ODCONF_ODCF6_LENGTH                                0x1
#define _ODCONF_ODCF6_MASK                                  0x40
#define _ODCONF_ODCF7_POSN                                  0x7
#define _ODCONF_ODCF7_POSITION                              0x7
#define _ODCONF_ODCF7_SIZE                                  0x1
#define _ODCONF_ODCF7_LENGTH                                0x1
#define _ODCONF_ODCF7_MASK                                  0x80

// Register: WPUF
#define WPUF WPUF
extern volatile unsigned char           WPUF                __at(0xEB3);
#ifndef _LIB_BUILD
asm("WPUF equ 0EB3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUF0                  :1;
        unsigned WPUF1                  :1;
        unsigned WPUF2                  :1;
        unsigned WPUF3                  :1;
        unsigned WPUF4                  :1;
        unsigned WPUF5                  :1;
        unsigned WPUF6                  :1;
        unsigned WPUF7                  :1;
    };
} WPUFbits_t;
extern volatile WPUFbits_t WPUFbits __at(0xEB3);
// bitfield macros
#define _WPUF_WPUF0_POSN                                    0x0
#define _WPUF_WPUF0_POSITION                                0x0
#define _WPUF_WPUF0_SIZE                                    0x1
#define _WPUF_WPUF0_LENGTH                                  0x1
#define _WPUF_WPUF0_MASK                                    0x1
#define _WPUF_WPUF1_POSN                                    0x1
#define _WPUF_WPUF1_POSITION                                0x1
#define _WPUF_WPUF1_SIZE                                    0x1
#define _WPUF_WPUF1_LENGTH                                  0x1
#define _WPUF_WPUF1_MASK                                    0x2
#define _WPUF_WPUF2_POSN                                    0x2
#define _WPUF_WPUF2_POSITION                                0x2
#define _WPUF_WPUF2_SIZE                                    0x1
#define _WPUF_WPUF2_LENGTH                                  0x1
#define _WPUF_WPUF2_MASK                                    0x4
#define _WPUF_WPUF3_POSN                                    0x3
#define _WPUF_WPUF3_POSITION                                0x3
#define _WPUF_WPUF3_SIZE                                    0x1
#define _WPUF_WPUF3_LENGTH                                  0x1
#define _WPUF_WPUF3_MASK                                    0x8
#define _WPUF_WPUF4_POSN                                    0x4
#define _WPUF_WPUF4_POSITION                                0x4
#define _WPUF_WPUF4_SIZE                                    0x1
#define _WPUF_WPUF4_LENGTH                                  0x1
#define _WPUF_WPUF4_MASK                                    0x10
#define _WPUF_WPUF5_POSN                                    0x5
#define _WPUF_WPUF5_POSITION                                0x5
#define _WPUF_WPUF5_SIZE                                    0x1
#define _WPUF_WPUF5_LENGTH                                  0x1
#define _WPUF_WPUF5_MASK                                    0x20
#define _WPUF_WPUF6_POSN                                    0x6
#define _WPUF_WPUF6_POSITION                                0x6
#define _WPUF_WPUF6_SIZE                                    0x1
#define _WPUF_WPUF6_LENGTH                                  0x1
#define _WPUF_WPUF6_MASK                                    0x40
#define _WPUF_WPUF7_POSN                                    0x7
#define _WPUF_WPUF7_POSITION                                0x7
#define _WPUF_WPUF7_SIZE                                    0x1
#define _WPUF_WPUF7_LENGTH                                  0x1
#define _WPUF_WPUF7_MASK                                    0x80

// Register: ANSELF
#define ANSELF ANSELF
extern volatile unsigned char           ANSELF              __at(0xEB4);
#ifndef _LIB_BUILD
asm("ANSELF equ 0EB4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELF0                :1;
        unsigned ANSELF1                :1;
        unsigned ANSELF2                :1;
        unsigned ANSELF3                :1;
        unsigned ANSELF4                :1;
        unsigned ANSELF5                :1;
        unsigned ANSELF6                :1;
        unsigned ANSELF7                :1;
    };
} ANSELFbits_t;
extern volatile ANSELFbits_t ANSELFbits __at(0xEB4);
// bitfield macros
#define _ANSELF_ANSELF0_POSN                                0x0
#define _ANSELF_ANSELF0_POSITION                            0x0
#define _ANSELF_ANSELF0_SIZE                                0x1
#define _ANSELF_ANSELF0_LENGTH                              0x1
#define _ANSELF_ANSELF0_MASK                                0x1
#define _ANSELF_ANSELF1_POSN                                0x1
#define _ANSELF_ANSELF1_POSITION                            0x1
#define _ANSELF_ANSELF1_SIZE                                0x1
#define _ANSELF_ANSELF1_LENGTH                              0x1
#define _ANSELF_ANSELF1_MASK                                0x2
#define _ANSELF_ANSELF2_POSN                                0x2
#define _ANSELF_ANSELF2_POSITION                            0x2
#define _ANSELF_ANSELF2_SIZE                                0x1
#define _ANSELF_ANSELF2_LENGTH                              0x1
#define _ANSELF_ANSELF2_MASK                                0x4
#define _ANSELF_ANSELF3_POSN                                0x3
#define _ANSELF_ANSELF3_POSITION                            0x3
#define _ANSELF_ANSELF3_SIZE                                0x1
#define _ANSELF_ANSELF3_LENGTH                              0x1
#define _ANSELF_ANSELF3_MASK                                0x8
#define _ANSELF_ANSELF4_POSN                                0x4
#define _ANSELF_ANSELF4_POSITION                            0x4
#define _ANSELF_ANSELF4_SIZE                                0x1
#define _ANSELF_ANSELF4_LENGTH                              0x1
#define _ANSELF_ANSELF4_MASK                                0x10
#define _ANSELF_ANSELF5_POSN                                0x5
#define _ANSELF_ANSELF5_POSITION                            0x5
#define _ANSELF_ANSELF5_SIZE                                0x1
#define _ANSELF_ANSELF5_LENGTH                              0x1
#define _ANSELF_ANSELF5_MASK                                0x20
#define _ANSELF_ANSELF6_POSN                                0x6
#define _ANSELF_ANSELF6_POSITION                            0x6
#define _ANSELF_ANSELF6_SIZE                                0x1
#define _ANSELF_ANSELF6_LENGTH                              0x1
#define _ANSELF_ANSELF6_MASK                                0x40
#define _ANSELF_ANSELF7_POSN                                0x7
#define _ANSELF_ANSELF7_POSITION                            0x7
#define _ANSELF_ANSELF7_SIZE                                0x1
#define _ANSELF_ANSELF7_LENGTH                              0x1
#define _ANSELF_ANSELF7_MASK                                0x80

// Register: IOCGF
#define IOCGF IOCGF
extern volatile unsigned char           IOCGF               __at(0xEB5);
#ifndef _LIB_BUILD
asm("IOCGF equ 0EB5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned IOCGF5                 :1;
    };
} IOCGFbits_t;
