GopalSaraf/Practicals/PSDL/include/proc/pic18f66k40.h
extern volatile IOCGFbits_t IOCGFbits __at(0xEB5);
// bitfield macros
#define _IOCGF_IOCGF5_POSN                                  0x5
#define _IOCGF_IOCGF5_POSITION                              0x5
#define _IOCGF_IOCGF5_SIZE                                  0x1
#define _IOCGF_IOCGF5_LENGTH                                0x1
#define _IOCGF_IOCGF5_MASK                                  0x20

// Register: IOCGN
#define IOCGN IOCGN
extern volatile unsigned char           IOCGN               __at(0xEB6);
#ifndef _LIB_BUILD
asm("IOCGN equ 0EB6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned IOCGN5                 :1;
    };
} IOCGNbits_t;
extern volatile IOCGNbits_t IOCGNbits __at(0xEB6);
// bitfield macros
#define _IOCGN_IOCGN5_POSN                                  0x5
#define _IOCGN_IOCGN5_POSITION                              0x5
#define _IOCGN_IOCGN5_SIZE                                  0x1
#define _IOCGN_IOCGN5_LENGTH                                0x1
#define _IOCGN_IOCGN5_MASK                                  0x20

// Register: IOCGP
#define IOCGP IOCGP
extern volatile unsigned char           IOCGP               __at(0xEB7);
#ifndef _LIB_BUILD
asm("IOCGP equ 0EB7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned IOCGP5                 :1;
    };
} IOCGPbits_t;
extern volatile IOCGPbits_t IOCGPbits __at(0xEB7);
// bitfield macros
#define _IOCGP_IOCGP5_POSN                                  0x5
#define _IOCGP_IOCGP5_POSITION                              0x5
#define _IOCGP_IOCGP5_SIZE                                  0x1
#define _IOCGP_IOCGP5_LENGTH                                0x1
#define _IOCGP_IOCGP5_MASK                                  0x20

// Register: INLVLG
#define INLVLG INLVLG
extern volatile unsigned char           INLVLG              __at(0xEB8);
#ifndef _LIB_BUILD
asm("INLVLG equ 0EB8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLG0                :1;
        unsigned INLVLG1                :1;
        unsigned INLVLG2                :1;
        unsigned INLVLG3                :1;
        unsigned INLVLG4                :1;
        unsigned INLVLG5                :1;
        unsigned INLVLG6                :1;
        unsigned INLVLG7                :1;
    };
} INLVLGbits_t;
extern volatile INLVLGbits_t INLVLGbits __at(0xEB8);
// bitfield macros
#define _INLVLG_INLVLG0_POSN                                0x0
#define _INLVLG_INLVLG0_POSITION                            0x0
#define _INLVLG_INLVLG0_SIZE                                0x1
#define _INLVLG_INLVLG0_LENGTH                              0x1
#define _INLVLG_INLVLG0_MASK                                0x1
#define _INLVLG_INLVLG1_POSN                                0x1
#define _INLVLG_INLVLG1_POSITION                            0x1
#define _INLVLG_INLVLG1_SIZE                                0x1
#define _INLVLG_INLVLG1_LENGTH                              0x1
#define _INLVLG_INLVLG1_MASK                                0x2
#define _INLVLG_INLVLG2_POSN                                0x2
#define _INLVLG_INLVLG2_POSITION                            0x2
#define _INLVLG_INLVLG2_SIZE                                0x1
#define _INLVLG_INLVLG2_LENGTH                              0x1
#define _INLVLG_INLVLG2_MASK                                0x4
#define _INLVLG_INLVLG3_POSN                                0x3
#define _INLVLG_INLVLG3_POSITION                            0x3
#define _INLVLG_INLVLG3_SIZE                                0x1
#define _INLVLG_INLVLG3_LENGTH                              0x1
#define _INLVLG_INLVLG3_MASK                                0x8
#define _INLVLG_INLVLG4_POSN                                0x4
#define _INLVLG_INLVLG4_POSITION                            0x4
#define _INLVLG_INLVLG4_SIZE                                0x1
#define _INLVLG_INLVLG4_LENGTH                              0x1
#define _INLVLG_INLVLG4_MASK                                0x10
#define _INLVLG_INLVLG5_POSN                                0x5
#define _INLVLG_INLVLG5_POSITION                            0x5
#define _INLVLG_INLVLG5_SIZE                                0x1
#define _INLVLG_INLVLG5_LENGTH                              0x1
#define _INLVLG_INLVLG5_MASK                                0x20
#define _INLVLG_INLVLG6_POSN                                0x6
#define _INLVLG_INLVLG6_POSITION                            0x6
#define _INLVLG_INLVLG6_SIZE                                0x1
#define _INLVLG_INLVLG6_LENGTH                              0x1
#define _INLVLG_INLVLG6_MASK                                0x40
#define _INLVLG_INLVLG7_POSN                                0x7
#define _INLVLG_INLVLG7_POSITION                            0x7
#define _INLVLG_INLVLG7_SIZE                                0x1
#define _INLVLG_INLVLG7_LENGTH                              0x1
#define _INLVLG_INLVLG7_MASK                                0x80

// Register: SLRCONG
#define SLRCONG SLRCONG
extern volatile unsigned char           SLRCONG             __at(0xEB9);
#ifndef _LIB_BUILD
asm("SLRCONG equ 0EB9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRG0                  :1;
        unsigned SLRG1                  :1;
        unsigned SLRG2                  :1;
        unsigned SLRG3                  :1;
        unsigned SLRG4                  :1;
        unsigned                        :1;
        unsigned SLRG6                  :1;
        unsigned SLRG7                  :1;
    };
} SLRCONGbits_t;
extern volatile SLRCONGbits_t SLRCONGbits __at(0xEB9);
// bitfield macros
#define _SLRCONG_SLRG0_POSN                                 0x0
#define _SLRCONG_SLRG0_POSITION                             0x0
#define _SLRCONG_SLRG0_SIZE                                 0x1
#define _SLRCONG_SLRG0_LENGTH                               0x1
#define _SLRCONG_SLRG0_MASK                                 0x1
#define _SLRCONG_SLRG1_POSN                                 0x1
#define _SLRCONG_SLRG1_POSITION                             0x1
#define _SLRCONG_SLRG1_SIZE                                 0x1
#define _SLRCONG_SLRG1_LENGTH                               0x1
#define _SLRCONG_SLRG1_MASK                                 0x2
#define _SLRCONG_SLRG2_POSN                                 0x2
#define _SLRCONG_SLRG2_POSITION                             0x2
#define _SLRCONG_SLRG2_SIZE                                 0x1
#define _SLRCONG_SLRG2_LENGTH                               0x1
#define _SLRCONG_SLRG2_MASK                                 0x4
#define _SLRCONG_SLRG3_POSN                                 0x3
#define _SLRCONG_SLRG3_POSITION                             0x3
#define _SLRCONG_SLRG3_SIZE                                 0x1
#define _SLRCONG_SLRG3_LENGTH                               0x1
#define _SLRCONG_SLRG3_MASK                                 0x8
#define _SLRCONG_SLRG4_POSN                                 0x4
#define _SLRCONG_SLRG4_POSITION                             0x4
#define _SLRCONG_SLRG4_SIZE                                 0x1
#define _SLRCONG_SLRG4_LENGTH                               0x1
#define _SLRCONG_SLRG4_MASK                                 0x10
#define _SLRCONG_SLRG6_POSN                                 0x6
#define _SLRCONG_SLRG6_POSITION                             0x6
#define _SLRCONG_SLRG6_SIZE                                 0x1
#define _SLRCONG_SLRG6_LENGTH                               0x1
#define _SLRCONG_SLRG6_MASK                                 0x40
#define _SLRCONG_SLRG7_POSN                                 0x7
#define _SLRCONG_SLRG7_POSITION                             0x7
#define _SLRCONG_SLRG7_SIZE                                 0x1
#define _SLRCONG_SLRG7_LENGTH                               0x1
#define _SLRCONG_SLRG7_MASK                                 0x80

// Register: ODCONG
#define ODCONG ODCONG
extern volatile unsigned char           ODCONG              __at(0xEBA);
#ifndef _LIB_BUILD
asm("ODCONG equ 0EBAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCG0                  :1;
        unsigned ODCG1                  :1;
        unsigned ODCG2                  :1;
        unsigned ODCG3                  :1;
        unsigned ODCG4                  :1;
        unsigned                        :1;
        unsigned ODCG6                  :1;
        unsigned ODCG7                  :1;
    };
} ODCONGbits_t;
extern volatile ODCONGbits_t ODCONGbits __at(0xEBA);
// bitfield macros
#define _ODCONG_ODCG0_POSN                                  0x0
#define _ODCONG_ODCG0_POSITION                              0x0
#define _ODCONG_ODCG0_SIZE                                  0x1
#define _ODCONG_ODCG0_LENGTH                                0x1
#define _ODCONG_ODCG0_MASK                                  0x1
#define _ODCONG_ODCG1_POSN                                  0x1
#define _ODCONG_ODCG1_POSITION                              0x1
#define _ODCONG_ODCG1_SIZE                                  0x1
#define _ODCONG_ODCG1_LENGTH                                0x1
#define _ODCONG_ODCG1_MASK                                  0x2
#define _ODCONG_ODCG2_POSN                                  0x2
#define _ODCONG_ODCG2_POSITION                              0x2
#define _ODCONG_ODCG2_SIZE                                  0x1
#define _ODCONG_ODCG2_LENGTH                                0x1
#define _ODCONG_ODCG2_MASK                                  0x4
#define _ODCONG_ODCG3_POSN                                  0x3
#define _ODCONG_ODCG3_POSITION                              0x3
#define _ODCONG_ODCG3_SIZE                                  0x1
#define _ODCONG_ODCG3_LENGTH                                0x1
#define _ODCONG_ODCG3_MASK                                  0x8
#define _ODCONG_ODCG4_POSN                                  0x4
#define _ODCONG_ODCG4_POSITION                              0x4
#define _ODCONG_ODCG4_SIZE                                  0x1
#define _ODCONG_ODCG4_LENGTH                                0x1
#define _ODCONG_ODCG4_MASK                                  0x10
#define _ODCONG_ODCG6_POSN                                  0x6
#define _ODCONG_ODCG6_POSITION                              0x6
#define _ODCONG_ODCG6_SIZE                                  0x1
#define _ODCONG_ODCG6_LENGTH                                0x1
#define _ODCONG_ODCG6_MASK                                  0x40
#define _ODCONG_ODCG7_POSN                                  0x7
#define _ODCONG_ODCG7_POSITION                              0x7
#define _ODCONG_ODCG7_SIZE                                  0x1
#define _ODCONG_ODCG7_LENGTH                                0x1
#define _ODCONG_ODCG7_MASK                                  0x80

// Register: WPUG
#define WPUG WPUG
extern volatile unsigned char           WPUG                __at(0xEBB);
#ifndef _LIB_BUILD
asm("WPUG equ 0EBBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUG0                  :1;
        unsigned WPUG1                  :1;
        unsigned WPUG2                  :1;
        unsigned WPUG3                  :1;
        unsigned WPUG4                  :1;
        unsigned WPUG5                  :1;
        unsigned WPUG6                  :1;
        unsigned WPUG7                  :1;
    };
} WPUGbits_t;
extern volatile WPUGbits_t WPUGbits __at(0xEBB);
// bitfield macros
#define _WPUG_WPUG0_POSN                                    0x0
#define _WPUG_WPUG0_POSITION                                0x0
#define _WPUG_WPUG0_SIZE                                    0x1
#define _WPUG_WPUG0_LENGTH                                  0x1
#define _WPUG_WPUG0_MASK                                    0x1
#define _WPUG_WPUG1_POSN                                    0x1
#define _WPUG_WPUG1_POSITION                                0x1
#define _WPUG_WPUG1_SIZE                                    0x1
#define _WPUG_WPUG1_LENGTH                                  0x1
#define _WPUG_WPUG1_MASK                                    0x2
#define _WPUG_WPUG2_POSN                                    0x2
#define _WPUG_WPUG2_POSITION                                0x2
#define _WPUG_WPUG2_SIZE                                    0x1
#define _WPUG_WPUG2_LENGTH                                  0x1
#define _WPUG_WPUG2_MASK                                    0x4
#define _WPUG_WPUG3_POSN                                    0x3
#define _WPUG_WPUG3_POSITION                                0x3
#define _WPUG_WPUG3_SIZE                                    0x1
#define _WPUG_WPUG3_LENGTH                                  0x1
#define _WPUG_WPUG3_MASK                                    0x8
#define _WPUG_WPUG4_POSN                                    0x4
#define _WPUG_WPUG4_POSITION                                0x4
#define _WPUG_WPUG4_SIZE                                    0x1
#define _WPUG_WPUG4_LENGTH                                  0x1
#define _WPUG_WPUG4_MASK                                    0x10
#define _WPUG_WPUG5_POSN                                    0x5
#define _WPUG_WPUG5_POSITION                                0x5
#define _WPUG_WPUG5_SIZE                                    0x1
#define _WPUG_WPUG5_LENGTH                                  0x1
#define _WPUG_WPUG5_MASK                                    0x20
#define _WPUG_WPUG6_POSN                                    0x6
#define _WPUG_WPUG6_POSITION                                0x6
#define _WPUG_WPUG6_SIZE                                    0x1
#define _WPUG_WPUG6_LENGTH                                  0x1
#define _WPUG_WPUG6_MASK                                    0x40
#define _WPUG_WPUG7_POSN                                    0x7
#define _WPUG_WPUG7_POSITION                                0x7
#define _WPUG_WPUG7_SIZE                                    0x1
#define _WPUG_WPUG7_LENGTH                                  0x1
#define _WPUG_WPUG7_MASK                                    0x80

