GopalSaraf/Practicals/PSDL/include/proc/pic18f66k40.h
extern volatile BAUDCTL3bits_t BAUDCTL3bits __at(0xEF0);
// bitfield macros
#define _BAUDCTL3_ABDEN_POSN                                0x0
#define _BAUDCTL3_ABDEN_POSITION                            0x0
#define _BAUDCTL3_ABDEN_SIZE                                0x1
#define _BAUDCTL3_ABDEN_LENGTH                              0x1
#define _BAUDCTL3_ABDEN_MASK                                0x1
#define _BAUDCTL3_WUE_POSN                                  0x1
#define _BAUDCTL3_WUE_POSITION                              0x1
#define _BAUDCTL3_WUE_SIZE                                  0x1
#define _BAUDCTL3_WUE_LENGTH                                0x1
#define _BAUDCTL3_WUE_MASK                                  0x2
#define _BAUDCTL3_BRG16_POSN                                0x3
#define _BAUDCTL3_BRG16_POSITION                            0x3
#define _BAUDCTL3_BRG16_SIZE                                0x1
#define _BAUDCTL3_BRG16_LENGTH                              0x1
#define _BAUDCTL3_BRG16_MASK                                0x8
#define _BAUDCTL3_SCKP_POSN                                 0x4
#define _BAUDCTL3_SCKP_POSITION                             0x4
#define _BAUDCTL3_SCKP_SIZE                                 0x1
#define _BAUDCTL3_SCKP_LENGTH                               0x1
#define _BAUDCTL3_SCKP_MASK                                 0x10
#define _BAUDCTL3_RCIDL_POSN                                0x6
#define _BAUDCTL3_RCIDL_POSITION                            0x6
#define _BAUDCTL3_RCIDL_SIZE                                0x1
#define _BAUDCTL3_RCIDL_LENGTH                              0x1
#define _BAUDCTL3_RCIDL_MASK                                0x40
#define _BAUDCTL3_ABDOVF_POSN                               0x7
#define _BAUDCTL3_ABDOVF_POSITION                           0x7
#define _BAUDCTL3_ABDOVF_SIZE                               0x1
#define _BAUDCTL3_ABDOVF_LENGTH                             0x1
#define _BAUDCTL3_ABDOVF_MASK                               0x80

// Register: RC2REG
#define RC2REG RC2REG
extern volatile unsigned char           RC2REG              __at(0xEF1);
#ifndef _LIB_BUILD
asm("RC2REG equ 0EF1h");
#endif
// aliases
extern volatile unsigned char           RCREG2              __at(0xEF1);
#ifndef _LIB_BUILD
asm("RCREG2 equ 0EF1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC2REG                 :8;
    };
} RC2REGbits_t;
extern volatile RC2REGbits_t RC2REGbits __at(0xEF1);
// bitfield macros
#define _RC2REG_RC2REG_POSN                                 0x0
#define _RC2REG_RC2REG_POSITION                             0x0
#define _RC2REG_RC2REG_SIZE                                 0x8
#define _RC2REG_RC2REG_LENGTH                               0x8
#define _RC2REG_RC2REG_MASK                                 0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned RC2REG                 :8;
    };
} RCREG2bits_t;
extern volatile RCREG2bits_t RCREG2bits __at(0xEF1);
// bitfield macros
#define _RCREG2_RC2REG_POSN                                 0x0
#define _RCREG2_RC2REG_POSITION                             0x0
#define _RCREG2_RC2REG_SIZE                                 0x8
#define _RCREG2_RC2REG_LENGTH                               0x8
#define _RCREG2_RC2REG_MASK                                 0xFF

// Register: TX2REG
#define TX2REG TX2REG
extern volatile unsigned char           TX2REG              __at(0xEF2);
#ifndef _LIB_BUILD
asm("TX2REG equ 0EF2h");
#endif
// aliases
extern volatile unsigned char           TXREG2              __at(0xEF2);
#ifndef _LIB_BUILD
asm("TXREG2 equ 0EF2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX2REG                 :8;
    };
} TX2REGbits_t;
extern volatile TX2REGbits_t TX2REGbits __at(0xEF2);
// bitfield macros
#define _TX2REG_TX2REG_POSN                                 0x0
#define _TX2REG_TX2REG_POSITION                             0x0
#define _TX2REG_TX2REG_SIZE                                 0x8
#define _TX2REG_TX2REG_LENGTH                               0x8
#define _TX2REG_TX2REG_MASK                                 0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TX2REG                 :8;
    };
} TXREG2bits_t;
extern volatile TXREG2bits_t TXREG2bits __at(0xEF2);
// bitfield macros
#define _TXREG2_TX2REG_POSN                                 0x0
#define _TXREG2_TX2REG_POSITION                             0x0
#define _TXREG2_TX2REG_SIZE                                 0x8
#define _TXREG2_TX2REG_LENGTH                               0x8
#define _TXREG2_TX2REG_MASK                                 0xFF

// Register: SP2BRG
#define SP2BRG SP2BRG
extern volatile unsigned short          SP2BRG              __at(0xEF3);
#ifndef _LIB_BUILD
asm("SP2BRG equ 0EF3h");
#endif

// Register: SP2BRGL
#define SP2BRGL SP2BRGL
extern volatile unsigned char           SP2BRGL             __at(0xEF3);
#ifndef _LIB_BUILD
asm("SP2BRGL equ 0EF3h");
#endif
// aliases
extern volatile unsigned char           SPBRG2              __at(0xEF3);
#ifndef _LIB_BUILD
asm("SPBRG2 equ 0EF3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SP2BRGL                :8;
    };
} SP2BRGLbits_t;
extern volatile SP2BRGLbits_t SP2BRGLbits __at(0xEF3);
// bitfield macros
#define _SP2BRGL_SP2BRGL_POSN                               0x0
#define _SP2BRGL_SP2BRGL_POSITION                           0x0
#define _SP2BRGL_SP2BRGL_SIZE                               0x8
#define _SP2BRGL_SP2BRGL_LENGTH                             0x8
#define _SP2BRGL_SP2BRGL_MASK                               0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned SP2BRGL                :8;
    };
} SPBRG2bits_t;
extern volatile SPBRG2bits_t SPBRG2bits __at(0xEF3);
// bitfield macros
#define _SPBRG2_SP2BRGL_POSN                                0x0
#define _SPBRG2_SP2BRGL_POSITION                            0x0
#define _SPBRG2_SP2BRGL_SIZE                                0x8
#define _SPBRG2_SP2BRGL_LENGTH                              0x8
#define _SPBRG2_SP2BRGL_MASK                                0xFF

// Register: SP2BRGH
#define SP2BRGH SP2BRGH
extern volatile unsigned char           SP2BRGH             __at(0xEF4);
#ifndef _LIB_BUILD
asm("SP2BRGH equ 0EF4h");
#endif
// aliases
extern volatile unsigned char           SPBRGH2             __at(0xEF4);
#ifndef _LIB_BUILD
asm("SPBRGH2 equ 0EF4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SP2BRGH                :8;
    };
} SP2BRGHbits_t;
extern volatile SP2BRGHbits_t SP2BRGHbits __at(0xEF4);
// bitfield macros
#define _SP2BRGH_SP2BRGH_POSN                               0x0
#define _SP2BRGH_SP2BRGH_POSITION                           0x0
#define _SP2BRGH_SP2BRGH_SIZE                               0x8
#define _SP2BRGH_SP2BRGH_LENGTH                             0x8
#define _SP2BRGH_SP2BRGH_MASK                               0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned SP2BRGH                :8;
    };
} SPBRGH2bits_t;
extern volatile SPBRGH2bits_t SPBRGH2bits __at(0xEF4);
// bitfield macros
#define _SPBRGH2_SP2BRGH_POSN                               0x0
#define _SPBRGH2_SP2BRGH_POSITION                           0x0
#define _SPBRGH2_SP2BRGH_SIZE                               0x8
#define _SPBRGH2_SP2BRGH_LENGTH                             0x8
#define _SPBRGH2_SP2BRGH_MASK                               0xFF

